probonopd/Synth_Dexed/esp32/main/step_sequencer.cpp
const harmonic_state_t* step_seq_get_display_harmonic_state(void)
{
    return &s_seq.display_harmonic;
}

/* Scale velocity by harmonic role when in FIELD mode.
 * Chord tone → full, scale tone (yellow) → ~66 %, tension (orange) → ~33 %.
 * Pass-through unchanged in all other modes. */
uint8_t step_seq_melodic_scale_velocity(uint8_t midi_note, uint8_t velocity)
{
    if (s_seq.mode != SEQ_MODE_FIELD) return velocity;
    uint8_t sc = score_note(midi_note, &s_seq.display_harmonic);
    if (sc >= 200) return velocity;                          /* chord tone */
    if (sc >= 120) return (uint8_t)((velocity * 2 + 2) / 3); /* scale tone ~66 % */
    uint8_t v = (uint8_t)((velocity + 2) / 3);               /* tension ~33 % */
    return v < 1 ? 1 : v;
}

uint8_t step_seq_get_field_note(uint8_t row, uint8_t col)
{
    return get_field_note(row, col, &s_seq.harmonic);
}

bool step_seq_is_chord_tone(uint8_t pitch_class, uint8_t chord_root, chord_type_t type)
{
    return is_chord_tone(pitch_class, chord_root, type);
}

bool step_seq_is_scale_tone(uint8_t pitch_class, uint8_t key, scale_type_t scale)
{
    return is_scale_tone(pitch_class, key, scale);
}

void step_seq_get_circle_chord(uint8_t row, uint8_t col, uint8_t* out_root, chord_type_t* out_type)
{
    get_circle_chord(row, col, s_seq.harmonic.key, out_root, out_type);
}
/* ================================================
 * Chord step sequencer query API
 * ================================================ */

bool step_seq_chord_seq_step_active(uint8_t step)
{
    if (step >= 32) return false;
    return s_seq.chord_seq_steps[step].active;
}

uint8_t step_seq_chord_seq_step_root(uint8_t step)
{
    if (step >= 32) return 0;
    return s_seq.chord_seq_steps[step].chord_root;
}

chord_type_t step_seq_chord_seq_step_type(uint8_t step)
{
    if (step >= 32) return CHORD_MAJ;
    return s_seq.chord_seq_steps[step].chord_type;
}

int step_seq_chord_seq_current(void)
{
    return s_seq.chord_seq_step;
}
